Repository: Avid29/MIPSer
Catalog: src/MIPS.Assembler/Resources/Logger.*.resx
Languages: he_il

# RegisterNumberNotFound
source: No register of number '{0}' exists.
he_il: לא קיים אוגר במספר ‎'{0}'.

# NoRelocatableMacros
source: Macros may not be a relocatable expression.
he_il: מאקרו אינו יכול להיות ביטוי בר־הזזה.

# PseudoInstructionsDisabled
source: Pseudo instructions are disabled.
he_il: פסאודו־הוראות מנוטרלות.

# RegisterNotFound
source: No register '{0}' exists.
he_il: לא קיים אוגר בשם ‎'{0}'.

# SymbolAlreadyDefined
source: Symbol '{0}' is already defined.
he_il: הסימבול ‎'{0}'‎ כבר מוגדר.

# SymbolCannotContain
source: '{0}' is not a valid symbol name. Symbol names cannot contain the character '{1}'.
he_il: ‎'{0}' אינו שם סימבול תקין. שמות סימבולים אינם יכולים להכיל את התו ‎'{1}'.

# SymbolMissingValue
source: Symbol '{0}' missing value.
he_il: לסימבול ‎'{0}' חסר ערך.

# SymbolsCannotBeginWithDigits
source: '{0}' is not a valid symbol name. Symbol names cannot begin with a digit.
he_il: ‎'{0}' אינו שם סימבול תקין. שמות סימבולים אינם יכולים להתחיל בספרה.

# DirectiveTakesNoArguments
source: '{0}' cannot take any arguments.
he_il: ‎'{0}' אינו יכול לקבל ארגומנטים.

# DirectiveTakesOneArgument
source: '{0}' only takes one argument.
he_il: ‎'{0}' מקבל ארגומנט אחד בלבד.

# DirectiveNonSymbolArgument
source: '{0}' only take a symbol for an argument. Cannot parse '{1}' as a symbol.
he_il: ‎'{0}' מקבל רק סימבול כארגומנט. לא ניתן לנתח את ‎'{1}' כסימבול.

# DirectiveNonSymbolArgumentSmall
source: '{0}' only take a symbol for an argument.
he_il: ‎'{0}' מקבל רק סימבול כארגומנט.

# DirectiveNoRelocatableArguments
source: '{0}' argument cannot be relocatable.
he_il: הארגומנט של ‎'{0}'‎ אינו יכול להיות בר־הזזה.

# DirectiveLargeAlignWarning
source: Large alignment of '{0}'. Warning threshold set to '{1}'.
he_il: יישור גדול של ‎'{0}'. רמת האזהרה מוגדרת כ־‎'{1}'.

# DirectiveLargeAlignMessage
source: Large alignment of '{0}'. Message threshold set to '{1}'.
he_il: יישור גדול של ‎'{0}'. רמת ההודעה מוגדרת כ־‎'{1}'.

# DirectiveLargeSpaceMessage
source: Large spacing of '{0}'. Message threshold set to '{1}'.
he_il: רווח גדול של ‎'{0}'. רמת ההודעה מוגדרת כ־‎'{1}'.

# DirectiveAllocationNoRelocatableArguments
source: '{0}' allocations cannot be relocatable.
he_il: הקצאות ‎'{0}'‎ אינן יכולות להיות ברות־הזזה.

# DirectiveAllocationTruncated
source: '{0}' was evaluated to '{1}' and subsequently truncated to '{2}'.
he_il: ‎'{0}' חושב ל־‎'{1}'‎ ונחתך לאחר מכן ל־‎'{2}'.

# ExpressionParsingFailed
source: Could not parse '{0}' as an expression.
he_il: לא ניתן לנתח את ‎'{0}' כביטוי.

# StringsCantWrapLines
source: Strings may not wrap between lines.
he_il: מחרוזות אינן יכולות להישבר בין שורות.

# CharactersCantWrapLines
source: Character literals may not wrap between lines.
he_il: תווי־ממש אינם יכולים להישבר בין שורות.

# EmptyCharacterLiteral
source: Character literal cannot be empty.
he_il: תו־ממש לא יכול להיות ריק.

# IncompleteReference
source: Incomplete symbol reference '{0}'.
he_il: הפניה לסימבול ‎'{0}'‎ אינה שלמה.

# IncompleteToken
source: Incomplete token '{0}'.
he_il: אסימון ‎'{0}'‎ אינו שלם.

# IncompleteRegister
source: Incomplete register name '{0}'.
he_il: שם האוגר ‎'{0}'‎ אינו שלם.

# IncompleteImmediate
source: Incomplete immediate value '{0}'.
he_il: ערך מיידי ‎'{0}'‎ אינו שלם.

# CantAddRelocatables
source: Cannot sum two relocatable symbols.
he_il: לא ניתן לחבר שני סימבולים בני־הזזה.

# CantXORRelocatable
source: Cannot perform XOR operation with a relocatable symbol.
he_il: לא ניתן לבצע פעולת XOR עם סימבול בר־הזזה.

# CantNOTRelocatable
source: Cannot perform NOT operation with a relocatable symbol.
he_il: לא ניתן לבצע פעולת NOT עם סימבול בר־הזזה.

# CantORRelocatable
source: Cannot perform OR operation with a relocatable symbol.
he_il: לא ניתן לבצע פעולת OR עם סימבול בר־הזזה.

# CantANDRelocatable
source: Cannot perform AND operation with a relocatable symbol.
he_il: לא ניתן לבצע פעולת AND עם סימבול בר־הזזה.

# CantNegateRelocatable
source: Cannot negate a relocatable symbol.
he_il: לא ניתן לשלול סימבול בר־הזזה.

# CantModulusRelocatable
source: Cannot perform modulus operation with a relocatable symbol.
he_il: לא ניתן לבצע פעולת מודולוס עם סימבול בר־הזזה.

# CantDivideRelocatable
source: Cannot perform division with a relocatable symbol.
he_il: לא ניתן לבצע חילוק עם סימבול בר־הזזה.

# CantMultiplyRelocatable
source: Cannot perform multiplication operation with a relocatable symbol.
he_il: לא ניתן לבצע פעולת כפל עם סימבול בר־הזזה.

# CantSubtractRelocatable
source: Cannot subtract a relocatable symbol.
he_il: לא ניתן לחסר סימבול בר־הזזה.

# ZeroRegisterWriteback
source: This instruction writes to $zero.
he_il: הוראה זו כותבת לאוגר ‎$zero‎.

# RequiresVersion
source: The instruction '{0}' requires mips version {1}.
he_il: ההוראה ‎'{0}'‎ דורשת גרסת MIPS ‎{1}.

# RemovedInVersion
source: The instruction '{0}' is deprecated. Last supported in mips version {1}.
he_il: ההוראה ‎'{0}'‎ הוצאה משימוש. נתמכה לאחרונה בגרסת MIPS ‎{1}.

# WrongArgumentCount
source: Instruction '{0}' cannot take '{1}' arguments.
he_il: ההוראה ‎'{0}'‎ אינה יכולה לקבל ‎{1}‎ ארגומנטים.

# DoesNotSupportFormatSingle
source: Instruction '{0}' does not support the format 'Single'.
he_il: ההוראה ‎'{0}'‎ אינה תומכת בתצורה ‎'Single'‎ (דיוק יחיד).

# DoesNotSupportFormatDouble
source: Instruction '{0}' does not support the format 'Double'.
he_il: ההוראה ‎'{0}'‎ אינה תומכת בתצורה ‎'Double'‎ (דיוק כפול).

# DoesNotSupportFormatWord
source: Instruction '{0}' does not support the format 'Word'.
he_il: ההוראה ‎'{0}'‎ אינה תומכת בתצורה ‎'Word'‎ (מילה).

# DoesNotSupportFormatLong
source: Instruction '{0}' does not support the format 'Long'.
he_il: ההוראה ‎'{0}'‎ אינה תומכת בתצורה ‎'Long'‎ (ארוך).

# DoesNotSupportFormatPairedSingle
source: Instruction '{0}' does not support the format 'Paired Single'.
he_il: ההוראה ‎'{0}'‎ אינה תומכת בתצורה ‎'Paired Single'‎ (זוג דיוק יחיד).

# NoRelocatableShiftAmount
source: Shift amount argument cannot reference relocatable symbols.
he_il: ארגומנט של גודל ההזזה לא יכול להפנות לסימבולים בני־הזזה.

# CantBranchBetweenSections
source: Cannot branch between sections.
he_il: לא ניתן לבצע הסתעפות בין מקטעים.

# ArgumentNotARegister
source: '{0}' is not a valid register argument.
he_il: ‎'{0}'‎ אינו ארגומנט אוגר תקין.

# RegisterMustBeInGeneralPurposeSet
source: Invalid register argument '{0}'. Must be in general purpose register set.
he_il: ארגומנט האוגר ‎'{0}'‎ אינו תקין. עליו להיות באוסף האוגרים הכלליים.

# RegisterMustBeInCoProc0Set
source: Invalid register argument '{0}'. Must be in coprocessor0 register set.
he_il: ארגומנט האוגר ‎'{0}'‎ אינו תקין. עליו להיות באוסף האוגרים של Coprocessor0.

# RegisterMustBeInFloatingPointsSet
source: Invalid register argument '{0}'. Must be in floating-point register set.
he_il: ארגומנט האוגר ‎'{0}'‎ אינו תקין. עליו להיות באוסף האוגרים של נקודה צפה.

# InvalidAddressOffsetArgument
source: Argument '{0}' is not a valid address offset.
he_il: הארגומנט ‎'{0}'‎ אינו היסט כתובת תקין.

# CastWarningSignChanged
source: Expression '{0}' evaluated to signed value '{1}' but was cast to an unsigned value, resulting in '{2}'.
he_il: הביטוי ‎'{0}'‎ הוערך לערך חתום ‎'{1}'‎ אך הומר לערך בלתי־חתום, והתוצאה היא ‎'{2}'‎.

# CastWarningTruncatedHigh
source: Expression '{0}' evaluated to {1} but was truncated to {3}-bits, resulting in '{2}'.
he_il: הביטוי ‎'{0}'‎ הוערך ל־{1}‎ אך נחתך ל־{3}‎ סיביות, והתוצאה היא ‎'{2}'‎.

# CastWarningTruncatedHighAndSignChanged
source: Expression '{0}' evaluated to {1} but was truncated to an unsigned value with {3}-bits, resulting in {2}.
he_il: הביטוי ‎'{0}'‎ הוערך ל־{1}‎ אך נחתך לערך בלתי־חתום של ‎{3}‎ סיביות, והתוצאה היא ‎{2}‎.

# CastWarningTruncatedLowAndHigh
source: Expression '{0}' evaluated to {1} but was truncated to {3}-bits with the lower {4} bits dropped, resulting in {2}.
he_il: הביטוי ‎'{0}'‎ הוערך ל־{1}‎ אך נחתך ל־{3}‎ סיביות לאחר שהוסרו {4}‎ הסיביות הנמוכות, והתוצאה היא ‎{2}‎.

# CastWarningTruncatedLow
source: Expression '{0}' evaluated to {1} but was truncated with the lower {4} bits dropped, resulting in {2}.
he_il: הביטוי ‎'{0}'‎ הוערך ל־{1}‎ אך נחתך לאחר שהוסרו {4}‎ הסיביות הנמוכות, והתוצאה היא ‎{2}‎.

# CastWarningTruncatedLowAndHighAndSignChanged
source: Expression '{0}' evaluated to '{1}' but was truncated to an unsigned value with '{3}-bits' and the lower '{4} bits' dropped, resulting in '{2}'.
he_il: הביטוי ‎'{0}'‎ הוערך ל־‎'{1}'‎ אך נחתך לערך בלתי־חתום של ‎'{3}‎ סיביות' לאחר שהוסרו ‎'{4}‎ הסיביות הנמוכות, והתוצאה היא ‎'{2}'‎.

# CastWarningTruncatedLowAndSignChanged
source: Expression '{0}' evaluated to {1} but was truncated to an unsigned value with the lower {4} bits, resulting in {2}.
he_il: הביטוי ‎'{0}'‎ הוערך ל־{1}‎ אך נחתך לערך בלתי־חתום לאחר הסרת {4}‎ הסיביות הנמוכות, והתוצאה היא ‎{2}‎.

# MustBeSingleCharacter
source: Character literal must be a single character.
he_il: תו־ממש חייב להכיל תו אחד בלבד.

# ExpectedString
source: Expected a string.
he_il: נדרשה מחרוזת.

# ExpectedChar
source: Expected a char.
he_il: נדרש תו.

source: Incomplete escape sequence.
he_il: רצף בריחה לא שלם.

# UnescapedQuoteInString
source: Unescaped quote inside string.
he_il: גרש שאינה מופרדת בתוך מחרוזת.

# UnrecognizedEscapeSequence
source: '{0}' is not a recognized escape sequence.
he_il: ‎'{0}'‎ אינו רצף בריחה מוכר.

# FailedToLoadModule
source: Module could not be loaded.
he_il: לא ניתן היה לטעון את המודול.

# DirectiveRequiresAnArgument
source: '{0}' requires an argument.
he_il: ‎'{0}'‎ דורש ארגומנט.

# NoInstructionNamed
source: No instruction named '{0}'.
he_il: אין הוראה בשם '{0}'.

# UnexpectedToken
source: Unexpected Token '{0}'.
he_il: אסימון בלתי צפוי ‎'{0}'‎.

# EmptyArgument
source: Argument is empty.
he_il: הארגומנט ריק.
